////////////////////////////////////////////////////////
//                                                    //
//           Библиотека классов для работы            //
//              с файлами в формате DBS               //
//                      ©2002                         //
//     Разработчик: Полевов Александр Валерьевич      //
//             аспирантура УГТУ-УПИ                   //
//       Механико Машиностроительный Факультет        //
//                 Кафедра САПР                       //
//                                                    //
////////////////////////////////////////////////////////

#ifndef _LISTOFPOINT_
#define _LISTOFPOINT_

#include "Point.h"

class CListOfPoint  
{
public:
    CListOfPoint();
    ~CListOfPoint();
    CdbsPoint Point;
    CListOfPoint *Next; //ссылка на следующую точку контура
    CListOfPoint *Prev; //ссылка на предыдущую точку контура

};

#endif 
