////////////////////////////////////////////////////////
//                                                    //
//           Библиотека классов для работы            //
//              с файлами в формате DBS               //
//                      ©2002                         //
//     Разработчик: Полевов Александр Валерьевич      //
//             аспирантура УГТУ-УПИ                   //
//       Механико Машиностроительный Факультет        //
//                 Кафедра САПР                       //
//                                                    //
////////////////////////////////////////////////////////

#ifndef _LISTINFILE_
#define _LISTINFILE_

class CListInFile
{
public:
    CListInFile();
    ~CListInFile();
    char *Data; //указатель на запись из файла геометрии
    CListInFile *Next; //указатель на следующую запись

};

#endif
