////////////////////////////////////////////////////////
//                                                    //
//           Библиотека классов для работы            //
//              с файлами в формате DBS               //
//                      ©2002                         //
//     Разработчик: Полевов Александр Валерьевич      //
//             аспирантура УГТУ-УПИ                   //
//       Механико Машиностроительный Факультет        //
//                 Кафедра САПР                       //
//                                                    //
////////////////////////////////////////////////////////

#ifndef _LISTOFDETAIL_
#define _LISTOFDETAIL_

#include "Detail.h"

class CListOfDetail  
{
public:
    CListOfDetail();
    ~CListOfDetail();
    CDetail *Detail; //указатель на данные о детали
    CListOfDetail *Next; //указатель на следующую запись

};

#endif
