////////////////////////////////////////////////////////
//                                                    //
//           Библиотека классов для работы            //
//              с файлами в формате DBS               //
//                      ©2002                         //
//     Разработчик: Полевов Александр Валерьевич      //
//             аспирантура УГТУ-УПИ                   //
//       Механико Машиностроительный Факультет        //
//                 Кафедра САПР                       //
//                                                    //
////////////////////////////////////////////////////////

#ifndef _LISTOFSPLINE_
#define _LISTOFSPLINE_

#include "Spline.h"

class CListOfSpline
{
public:
    CListOfSpline();
    ~CListOfSpline();
    CSpline *Spline; //указатель на данные из записи типа 1
    CListOfSpline *Next; //указатель на следующую запись
};

#endif
