////////////////////////////////////////////////////////
//                                                    //
//           Библиотека классов для работы            //
//              с файлами в формате DBS               //
//                      ©2002                         //
//     Разработчик: Полевов Александр Валерьевич      //
//             аспирантура УГТУ-УПИ                   //
//       Механико Машиностроительный Факультет        //
//                 Кафедра САПР                       //
//                                                    //
////////////////////////////////////////////////////////

#ifndef _SEGMENT_
#define _SEGMENT_

//#include "Box.h"
#include "Transform.h"

class CSegment  
{
public:
    void operator =(CSegment *Segment);
    float x_begin; //координата X начала сегмента
    float y_begin; //координата Y начала сегмента
    float x_end; //координата X конца сегмента
    float y_end; //координата Y конца сегмента
    float z; //компонента Z сегмента
    CSegment();
    ~CSegment();
};

#endif
