////////////////////////////////////////////////////////
//                                                    //
//           Библиотека классов для работы            //
//              с файлами в формате DBS               //
//                      ©2002                         //
//     Разработчик: Полевов Александр Валерьевич      //
//             аспирантура УГТУ-УПИ                   //
//       Механико Машиностроительный Факультет        //
//                 Кафедра САПР                       //
//                                                    //
////////////////////////////////////////////////////////

#include "define.h"
#include "Segment.h"

CSegment::CSegment()
{
    x_begin=0;
    y_begin=0;
    x_end=0;
    y_end=0;
    z=0;
}

CSegment::~CSegment()
{

}
